bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21G17A.atdf
        <register name="TXBCR" offset="0xD4" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Cancellation Request">
          <bitfield name="CR0" caption="Cancellation Request 0" mask="0x1"/>
          <bitfield name="CR1" caption="Cancellation Request 1" mask="0x2"/>
          <bitfield name="CR2" caption="Cancellation Request 2" mask="0x4"/>
          <bitfield name="CR3" caption="Cancellation Request 3" mask="0x8"/>
          <bitfield name="CR4" caption="Cancellation Request 4" mask="0x10"/>
          <bitfield name="CR5" caption="Cancellation Request 5" mask="0x20"/>
          <bitfield name="CR6" caption="Cancellation Request 6" mask="0x40"/>
          <bitfield name="CR7" caption="Cancellation Request 7" mask="0x80"/>
          <bitfield name="CR8" caption="Cancellation Request 8" mask="0x100"/>
          <bitfield name="CR9" caption="Cancellation Request 9" mask="0x200"/>
          <bitfield name="CR10" caption="Cancellation Request 10" mask="0x400"/>
          <bitfield name="CR11" caption="Cancellation Request 11" mask="0x800"/>
          <bitfield name="CR12" caption="Cancellation Request 12" mask="0x1000"/>
          <bitfield name="CR13" caption="Cancellation Request 13" mask="0x2000"/>
          <bitfield name="CR14" caption="Cancellation Request 14" mask="0x4000"/>
          <bitfield name="CR15" caption="Cancellation Request 15" mask="0x8000"/>
          <bitfield name="CR16" caption="Cancellation Request 16" mask="0x10000"/>
          <bitfield name="CR17" caption="Cancellation Request 17" mask="0x20000"/>
          <bitfield name="CR18" caption="Cancellation Request 18" mask="0x40000"/>
          <bitfield name="CR19" caption="Cancellation Request 19" mask="0x80000"/>
          <bitfield name="CR20" caption="Cancellation Request 20" mask="0x100000"/>
          <bitfield name="CR21" caption="Cancellation Request 21" mask="0x200000"/>
          <bitfield name="CR22" caption="Cancellation Request 22" mask="0x400000"/>
          <bitfield name="CR23" caption="Cancellation Request 23" mask="0x800000"/>
          <bitfield name="CR24" caption="Cancellation Request 24" mask="0x1000000"/>
          <bitfield name="CR25" caption="Cancellation Request 25" mask="0x2000000"/>
          <bitfield name="CR26" caption="Cancellation Request 26" mask="0x4000000"/>
          <bitfield name="CR27" caption="Cancellation Request 27" mask="0x8000000"/>
          <bitfield name="CR28" caption="Cancellation Request 28" mask="0x10000000"/>
          <bitfield name="CR29" caption="Cancellation Request 29" mask="0x20000000"/>
          <bitfield name="CR30" caption="Cancellation Request 30" mask="0x40000000"/>
          <bitfield name="CR31" caption="Cancellation Request 31" mask="0x80000000"/>
        </register>
        <register name="TXBTO" offset="0xD8" rw="R" size="4" initval="0x00000000" caption="Tx Buffer Transmission Occurred">
          <bitfield name="TO0" caption="Transmission Occurred 0" mask="0x1"/>
          <bitfield name="TO1" caption="Transmission Occurred 1" mask="0x2"/>
          <bitfield name="TO2" caption="Transmission Occurred 2" mask="0x4"/>
          <bitfield name="TO3" caption="Transmission Occurred 3" mask="0x8"/>
          <bitfield name="TO4" caption="Transmission Occurred 4" mask="0x10"/>
          <bitfield name="TO5" caption="Transmission Occurred 5" mask="0x20"/>
          <bitfield name="TO6" caption="Transmission Occurred 6" mask="0x40"/>
          <bitfield name="TO7" caption="Transmission Occurred 7" mask="0x80"/>
          <bitfield name="TO8" caption="Transmission Occurred 8" mask="0x100"/>
          <bitfield name="TO9" caption="Transmission Occurred 9" mask="0x200"/>
          <bitfield name="TO10" caption="Transmission Occurred 10" mask="0x400"/>
          <bitfield name="TO11" caption="Transmission Occurred 11" mask="0x800"/>
          <bitfield name="TO12" caption="Transmission Occurred 12" mask="0x1000"/>
          <bitfield name="TO13" caption="Transmission Occurred 13" mask="0x2000"/>
          <bitfield name="TO14" caption="Transmission Occurred 14" mask="0x4000"/>
          <bitfield name="TO15" caption="Transmission Occurred 15" mask="0x8000"/>
          <bitfield name="TO16" caption="Transmission Occurred 16" mask="0x10000"/>
          <bitfield name="TO17" caption="Transmission Occurred 17" mask="0x20000"/>
          <bitfield name="TO18" caption="Transmission Occurred 18" mask="0x40000"/>
          <bitfield name="TO19" caption="Transmission Occurred 19" mask="0x80000"/>
          <bitfield name="TO20" caption="Transmission Occurred 20" mask="0x100000"/>
          <bitfield name="TO21" caption="Transmission Occurred 21" mask="0x200000"/>
          <bitfield name="TO22" caption="Transmission Occurred 22" mask="0x400000"/>
          <bitfield name="TO23" caption="Transmission Occurred 23" mask="0x800000"/>
          <bitfield name="TO24" caption="Transmission Occurred 24" mask="0x1000000"/>
          <bitfield name="TO25" caption="Transmission Occurred 25" mask="0x2000000"/>
          <bitfield name="TO26" caption="Transmission Occurred 26" mask="0x4000000"/>
          <bitfield name="TO27" caption="Transmission Occurred 27" mask="0x8000000"/>
          <bitfield name="TO28" caption="Transmission Occurred 28" mask="0x10000000"/>
          <bitfield name="TO29" caption="Transmission Occurred 29" mask="0x20000000"/>
          <bitfield name="TO30" caption="Transmission Occurred 30" mask="0x40000000"/>
          <bitfield name="TO31" caption="Transmission Occurred 31" mask="0x80000000"/>
        </register>
        <register name="TXBCF" offset="0xDC" rw="R" size="4" initval="0x00000000" caption="Tx Buffer Cancellation Finished">
          <bitfield name="CF0" caption="Tx Buffer Cancellation Finished 0" mask="0x1"/>
          <bitfield name="CF1" caption="Tx Buffer Cancellation Finished 1" mask="0x2"/>
          <bitfield name="CF2" caption="Tx Buffer Cancellation Finished 2" mask="0x4"/>
          <bitfield name="CF3" caption="Tx Buffer Cancellation Finished 3" mask="0x8"/>
          <bitfield name="CF4" caption="Tx Buffer Cancellation Finished 4" mask="0x10"/>
          <bitfield name="CF5" caption="Tx Buffer Cancellation Finished 5" mask="0x20"/>
          <bitfield name="CF6" caption="Tx Buffer Cancellation Finished 6" mask="0x40"/>
          <bitfield name="CF7" caption="Tx Buffer Cancellation Finished 7" mask="0x80"/>
          <bitfield name="CF8" caption="Tx Buffer Cancellation Finished 8" mask="0x100"/>
          <bitfield name="CF9" caption="Tx Buffer Cancellation Finished 9" mask="0x200"/>
          <bitfield name="CF10" caption="Tx Buffer Cancellation Finished 10" mask="0x400"/>
          <bitfield name="CF11" caption="Tx Buffer Cancellation Finished 11" mask="0x800"/>
          <bitfield name="CF12" caption="Tx Buffer Cancellation Finished 12" mask="0x1000"/>
          <bitfield name="CF13" caption="Tx Buffer Cancellation Finished 13" mask="0x2000"/>
          <bitfield name="CF14" caption="Tx Buffer Cancellation Finished 14" mask="0x4000"/>
          <bitfield name="CF15" caption="Tx Buffer Cancellation Finished 15" mask="0x8000"/>
          <bitfield name="CF16" caption="Tx Buffer Cancellation Finished 16" mask="0x10000"/>
          <bitfield name="CF17" caption="Tx Buffer Cancellation Finished 17" mask="0x20000"/>
          <bitfield name="CF18" caption="Tx Buffer Cancellation Finished 18" mask="0x40000"/>
          <bitfield name="CF19" caption="Tx Buffer Cancellation Finished 19" mask="0x80000"/>
          <bitfield name="CF20" caption="Tx Buffer Cancellation Finished 20" mask="0x100000"/>
          <bitfield name="CF21" caption="Tx Buffer Cancellation Finished 21" mask="0x200000"/>
          <bitfield name="CF22" caption="Tx Buffer Cancellation Finished 22" mask="0x400000"/>
          <bitfield name="CF23" caption="Tx Buffer Cancellation Finished 23" mask="0x800000"/>
          <bitfield name="CF24" caption="Tx Buffer Cancellation Finished 24" mask="0x1000000"/>
          <bitfield name="CF25" caption="Tx Buffer Cancellation Finished 25" mask="0x2000000"/>
          <bitfield name="CF26" caption="Tx Buffer Cancellation Finished 26" mask="0x4000000"/>
          <bitfield name="CF27" caption="Tx Buffer Cancellation Finished 27" mask="0x8000000"/>
          <bitfield name="CF28" caption="Tx Buffer Cancellation Finished 28" mask="0x10000000"/>
          <bitfield name="CF29" caption="Tx Buffer Cancellation Finished 29" mask="0x20000000"/>
          <bitfield name="CF30" caption="Tx Buffer Cancellation Finished 30" mask="0x40000000"/>
          <bitfield name="CF31" caption="Tx Buffer Cancellation Finished 31" mask="0x80000000"/>
        </register>
        <register name="TXBTIE" offset="0xE0" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Transmission Interrupt Enable">
          <bitfield name="TIE0" caption="Transmission Interrupt Enable 0" mask="0x1"/>
          <bitfield name="TIE1" caption="Transmission Interrupt Enable 1" mask="0x2"/>
          <bitfield name="TIE2" caption="Transmission Interrupt Enable 2" mask="0x4"/>
          <bitfield name="TIE3" caption="Transmission Interrupt Enable 3" mask="0x8"/>
          <bitfield name="TIE4" caption="Transmission Interrupt Enable 4" mask="0x10"/>
          <bitfield name="TIE5" caption="Transmission Interrupt Enable 5" mask="0x20"/>
          <bitfield name="TIE6" caption="Transmission Interrupt Enable 6" mask="0x40"/>
          <bitfield name="TIE7" caption="Transmission Interrupt Enable 7" mask="0x80"/>
          <bitfield name="TIE8" caption="Transmission Interrupt Enable 8" mask="0x100"/>
          <bitfield name="TIE9" caption="Transmission Interrupt Enable 9" mask="0x200"/>
          <bitfield name="TIE10" caption="Transmission Interrupt Enable 10" mask="0x400"/>
          <bitfield name="TIE11" caption="Transmission Interrupt Enable 11" mask="0x800"/>
          <bitfield name="TIE12" caption="Transmission Interrupt Enable 12" mask="0x1000"/>
          <bitfield name="TIE13" caption="Transmission Interrupt Enable 13" mask="0x2000"/>
          <bitfield name="TIE14" caption="Transmission Interrupt Enable 14" mask="0x4000"/>
          <bitfield name="TIE15" caption="Transmission Interrupt Enable 15" mask="0x8000"/>
          <bitfield name="TIE16" caption="Transmission Interrupt Enable 16" mask="0x10000"/>
          <bitfield name="TIE17" caption="Transmission Interrupt Enable 17" mask="0x20000"/>
          <bitfield name="TIE18" caption="Transmission Interrupt Enable 18" mask="0x40000"/>
          <bitfield name="TIE19" caption="Transmission Interrupt Enable 19" mask="0x80000"/>
          <bitfield name="TIE20" caption="Transmission Interrupt Enable 20" mask="0x100000"/>
          <bitfield name="TIE21" caption="Transmission Interrupt Enable 21" mask="0x200000"/>
          <bitfield name="TIE22" caption="Transmission Interrupt Enable 22" mask="0x400000"/>
          <bitfield name="TIE23" caption="Transmission Interrupt Enable 23" mask="0x800000"/>
          <bitfield name="TIE24" caption="Transmission Interrupt Enable 24" mask="0x1000000"/>
          <bitfield name="TIE25" caption="Transmission Interrupt Enable 25" mask="0x2000000"/>
          <bitfield name="TIE26" caption="Transmission Interrupt Enable 26" mask="0x4000000"/>
          <bitfield name="TIE27" caption="Transmission Interrupt Enable 27" mask="0x8000000"/>
          <bitfield name="TIE28" caption="Transmission Interrupt Enable 28" mask="0x10000000"/>
          <bitfield name="TIE29" caption="Transmission Interrupt Enable 29" mask="0x20000000"/>
          <bitfield name="TIE30" caption="Transmission Interrupt Enable 30" mask="0x40000000"/>
          <bitfield name="TIE31" caption="Transmission Interrupt Enable 31" mask="0x80000000"/>
        </register>
        <register name="TXBCIE" offset="0xE4" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Cancellation Finished Interrupt Enable">
          <bitfield name="CFIE0" caption="Cancellation Finished Interrupt Enable 0" mask="0x1"/>
          <bitfield name="CFIE1" caption="Cancellation Finished Interrupt Enable 1" mask="0x2"/>
          <bitfield name="CFIE2" caption="Cancellation Finished Interrupt Enable 2" mask="0x4"/>
          <bitfield name="CFIE3" caption="Cancellation Finished Interrupt Enable 3" mask="0x8"/>
          <bitfield name="CFIE4" caption="Cancellation Finished Interrupt Enable 4" mask="0x10"/>
          <bitfield name="CFIE5" caption="Cancellation Finished Interrupt Enable 5" mask="0x20"/>
          <bitfield name="CFIE6" caption="Cancellation Finished Interrupt Enable 6" mask="0x40"/>
          <bitfield name="CFIE7" caption="Cancellation Finished Interrupt Enable 7" mask="0x80"/>
          <bitfield name="CFIE8" caption="Cancellation Finished Interrupt Enable 8" mask="0x100"/>
          <bitfield name="CFIE9" caption="Cancellation Finished Interrupt Enable 9" mask="0x200"/>
          <bitfield name="CFIE10" caption="Cancellation Finished Interrupt Enable 10" mask="0x400"/>
          <bitfield name="CFIE11" caption="Cancellation Finished Interrupt Enable 11" mask="0x800"/>
          <bitfield name="CFIE12" caption="Cancellation Finished Interrupt Enable 12" mask="0x1000"/>
          <bitfield name="CFIE13" caption="Cancellation Finished Interrupt Enable 13" mask="0x2000"/>
          <bitfield name="CFIE14" caption="Cancellation Finished Interrupt Enable 14" mask="0x4000"/>
          <bitfield name="CFIE15" caption="Cancellation Finished Interrupt Enable 15" mask="0x8000"/>
          <bitfield name="CFIE16" caption="Cancellation Finished Interrupt Enable 16" mask="0x10000"/>
          <bitfield name="CFIE17" caption="Cancellation Finished Interrupt Enable 17" mask="0x20000"/>
          <bitfield name="CFIE18" caption="Cancellation Finished Interrupt Enable 18" mask="0x40000"/>
          <bitfield name="CFIE19" caption="Cancellation Finished Interrupt Enable 19" mask="0x80000"/>
          <bitfield name="CFIE20" caption="Cancellation Finished Interrupt Enable 20" mask="0x100000"/>
          <bitfield name="CFIE21" caption="Cancellation Finished Interrupt Enable 21" mask="0x200000"/>
          <bitfield name="CFIE22" caption="Cancellation Finished Interrupt Enable 22" mask="0x400000"/>
          <bitfield name="CFIE23" caption="Cancellation Finished Interrupt Enable 23" mask="0x800000"/>
          <bitfield name="CFIE24" caption="Cancellation Finished Interrupt Enable 24" mask="0x1000000"/>
          <bitfield name="CFIE25" caption="Cancellation Finished Interrupt Enable 25" mask="0x2000000"/>
          <bitfield name="CFIE26" caption="Cancellation Finished Interrupt Enable 26" mask="0x4000000"/>
          <bitfield name="CFIE27" caption="Cancellation Finished Interrupt Enable 27" mask="0x8000000"/>
          <bitfield name="CFIE28" caption="Cancellation Finished Interrupt Enable 28" mask="0x10000000"/>
          <bitfield name="CFIE29" caption="Cancellation Finished Interrupt Enable 29" mask="0x20000000"/>
          <bitfield name="CFIE30" caption="Cancellation Finished Interrupt Enable 30" mask="0x40000000"/>
          <bitfield name="CFIE31" caption="Cancellation Finished Interrupt Enable 31" mask="0x80000000"/>
        </register>
        <register name="TXEFC" offset="0xF0" rw="RW" size="4" initval="0x00000000" caption="Tx Event FIFO Configuration">
          <bitfield name="EFSA" caption="Event FIFO Start Address" mask="0xFFFF"/>
          <bitfield name="EFS" caption="Event FIFO Size" mask="0x3F0000"/>
          <bitfield name="EFWM" caption="Event FIFO Watermark" mask="0x3F000000"/>
        </register>
        <register name="TXEFS" offset="0xF4" rw="R" size="4" initval="0x00000000" caption="Tx Event FIFO Status">
          <bitfield name="EFFL" caption="Event FIFO Fill Level" mask="0x3F"/>
          <bitfield name="EFGI" caption="Event FIFO Get Index" mask="0x1F00"/>
          <bitfield name="EFPI" caption="Event FIFO Put Index" mask="0x1F0000"/>
          <bitfield name="EFF" caption="Event FIFO Full" mask="0x1000000"/>
          <bitfield name="TEFL" caption="Tx Event FIFO Element Lost" mask="0x2000000"/>
        </register>
        <register name="TXEFA" offset="0xF8" rw="RW" size="4" initval="0x00000000" caption="Tx Event FIFO Acknowledge">
          <bitfield name="EFAI" caption="Event FIFO Acknowledge Index" mask="0x1F"/>
        </register>
      </register-group>
      <value-group name="CAN_SIDFE_0__SFEC">
        <value name="DISABLE" caption="Disable filter element" value="0"/>
        <value name="STF0M" caption="Store in Rx FIFO 0 if filter match" value="1"/>
        <value name="STF1M" caption="Store in Rx FIFO 1 if filter match" value="2"/>
        <value name="REJECT" caption="Reject ID if filter match" value="3"/>
        <value name="PRIORITY" caption="Set priority if filter match" value="4"/>
        <value name="PRIF0M" caption="Set priority and store in FIFO 0 if filter match" value="5"/>
        <value name="PRIF1M" caption="Set priority and store in FIFO 1 if filter match" value="6"/>
        <value name="STRXBUF" caption="Store into Rx Buffer" value="7"/>
      </value-group>
      <value-group name="CAN_SIDFE_0__SFT">
        <value name="RANGE" caption="Range filter from SFID1 to SFID2" value="0"/>
        <value name="DUAL" caption="Dual ID filter for SFID1 or SFID2" value="1"/>
        <value name="CLASSIC" caption="Classic filter" value="2"/>
      </value-group>
      <value-group name="CAN_XIDFE_0__EFEC">
        <value name="DISABLE" caption="Disable filter element" value="0"/>
        <value name="STF0M" caption="Store in Rx FIFO 0 if filter match" value="1"/>
        <value name="STF1M" caption="Store in Rx FIFO 1 if filter match" value="2"/>
        <value name="REJECT" caption="Reject ID if filter match" value="3"/>
        <value name="PRIORITY" caption="Set priority if filter match" value="4"/>
        <value name="PRIF0M" caption="Set priority and store in FIFO 0 if filter match" value="5"/>
        <value name="PRIF1M" caption="Set priority and store in FIFO 1 if filter match" value="6"/>
        <value name="STRXBUF" caption="Store into Rx Buffer" value="7"/>
      </value-group>
      <value-group name="CAN_TXEFE_1__ET">
        <value name="TXE" caption="Tx event" value="1"/>
        <value name="TXC" caption="Transmission in spite of cancellation" value="2"/>
      </value-group>
      <value-group name="CAN_XIDFE_1__EFT">
        <value name="RANGEM" caption="Range filter from EFID1 to EFID2" value="0"/>
        <value name="DUAL" caption="Dual ID filter for EFID1 or EFID2" value="1"/>
        <value name="CLASSIC" caption="Classic filter" value="2"/>
        <value name="RANGE" caption="Range filter from EFID1 to EFID2 with no XIDAM mask" value="3"/>
      </value-group>
