bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21G17A.atdf
        <register name="DPLLSTATUS" offset="0x30" rw="R" size="1" initval="0x00" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock Status" mask="0x1"/>
          <bitfield name="CLKRDY" caption="DPLL Clock Ready" mask="0x2"/>
        </register>
        <register name="CAL48M" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="48MHz Oscillator Calibration">
          <bitfield name="FCAL" caption="Frequency Calibration (48MHz)" mask="0x3F"/>
          <bitfield name="FRANGE" caption="Frequency Range (48MHz)" mask="0x300"/>
          <bitfield name="TCAL" caption="Temperature Calibration (48MHz)" mask="0x3F0000"/>
        </register>
      </register-group>
      <value-group name="OSCCTRL_XOSCCTRL__STARTUP">
        <value name="CYCLE1" caption="31 us" value="0"/>
        <value name="CYCLE2" caption="61 us" value="1"/>
        <value name="CYCLE4" caption="122 us" value="2"/>
        <value name="CYCLE8" caption="244 us" value="3"/>
        <value name="CYCLE16" caption="488 us" value="4"/>
        <value name="CYCLE32" caption="977 us" value="5"/>
        <value name="CYCLE64" caption="1953 us" value="6"/>
        <value name="CYCLE128" caption="3906 us" value="7"/>
        <value name="CYCLE256" caption="7813 us" value="8"/>
        <value name="CYCLE512" caption="15625 us" value="9"/>
        <value name="CYCLE1024" caption="31250 us" value="10"/>
        <value name="CYCLE2048" caption="62500 us" value="11"/>
        <value name="CYCLE4096" caption="125000 us" value="12"/>
        <value name="CYCLE8192" caption="250000 us" value="13"/>
        <value name="CYCLE16384" caption="500000 us" value="14"/>
        <value name="CYCLE32768" caption="1000000 us" value="15"/>
      </value-group>
      <value-group name="OSCCTRL_XOSCCTRL__GAIN">
        <value name="GAIN2" caption="2 MHz" value="0"/>
        <value name="GAIN4" caption="4 MHz" value="1"/>
        <value name="GAIN8" caption="8 MHz" value="2"/>
        <value name="GAIN16" caption="16 MHz" value="3"/>
        <value name="GAIN30" caption="30 MHz" value="4"/>
      </value-group>
      <value-group name="OSCCTRL_CFDPRESC__CFDPRESC">
        <value name="DIV1" caption="48 MHz" value="0"/>
        <value name="DIV2" caption="24 MHz" value="1"/>
        <value name="DIV4" caption="12 MHz" value="2"/>
        <value name="DIV8" caption="6 MHz" value="3"/>
        <value name="DIV16" caption="3 MHz" value="4"/>
        <value name="DIV32" caption="1.5 MHz" value="5"/>
        <value name="DIV64" caption="0.75 MHz" value="6"/>
        <value name="DIV128" caption="0.3125 MHz" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_OSC48MDIV__DIV">
        <value name="DIV1" caption="48 MHz" value="0"/>
        <value name="DIV2" caption="24 MHz" value="1"/>
        <value name="DIV3" caption="16 MHz" value="2"/>
        <value name="DIV4" caption="12 MHz" value="3"/>
        <value name="DIV5" caption="9.6 MHz" value="4"/>
        <value name="DIV6" caption="8 MHz" value="5"/>
        <value name="DIV7" caption="6.86 MHz" value="6"/>
        <value name="DIV8" caption="6 MHz" value="7"/>
        <value name="DIV9" caption="5.33 MHz" value="8"/>
        <value name="DIV10" caption="4.8 MHz" value="9"/>
        <value name="DIV11" caption="4.36 MHz" value="10"/>
        <value name="DIV12" caption="4 MHz" value="11"/>
        <value name="DIV13" caption="3.69 MHz" value="12"/>
        <value name="DIV14" caption="3.43 MHz" value="13"/>
        <value name="DIV15" caption="3.2 MHz" value="14"/>
        <value name="DIV16" caption="3 MHz" value="15"/>
      </value-group>
      <value-group name="OSCCTRL_OSC48MSTUP__STARTUP">
        <value name="CYCLE8" caption="166 ns" value="0"/>
        <value name="CYCLE16" caption="333 ns" value="1"/>
        <value name="CYCLE32" caption="667 ns" value="2"/>
        <value name="CYCLE64" caption="1.333 us" value="3"/>
        <value name="CYCLE128" caption="2.667 us" value="4"/>
        <value name="CYCLE256" caption="5.333 us" value="5"/>
        <value name="CYCLE512" caption="10.667 us" value="6"/>
        <value name="CYCLE1024" caption="21.333 us" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__LTIME">
        <value name="DEFAULT" caption="No time-out. Automatic lock." value="0"/>
        <value name="8MS" caption="Time-out if no lock within 8ms" value="4"/>
        <value name="9MS" caption="Time-out if no lock within 9ms" value="5"/>
        <value name="10MS" caption="Time-out if no lock within 10ms" value="6"/>
        <value name="11MS" caption="Time-out if no lock within 11ms" value="7"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__FILTER">
        <value name="DEFAULT" caption="Default filter mode" value="0"/>
        <value name="LBFILT" caption="Low bandwidth filter" value="1"/>
        <value name="HBFILT" caption="High bandwidth filter" value="2"/>
        <value name="HDFILT" caption="High damping filter" value="3"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLCTRLB__REFCLK">
        <value name="XOSC32K" caption="XOSC32K clock reference" value="0"/>
        <value name="XOSC" caption="XOSC clock reference" value="1"/>
        <value name="GCLK" caption="GCLK clock reference" value="2"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLPRESC__PRESC">
        <value name="DIV1" caption="DPLL output is divided by 1" value="0"/>
        <value name="DIV2" caption="DPLL output is divided by 2" value="1"/>
        <value name="DIV4" caption="DPLL output is divided by 4" value="2"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2246" version="2.1.0" caption="32k Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32k Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
          <bitfield name="CLKFAIL" caption="XOSC32K Clock Failure Detector Interrupt Enable" mask="0x4"/>
        </register>
